/*-----------------------------*
 *  include head files         *
 *----------------------------*/
#include ".\Head\HD_cfg.h"
#include ".\Head\Time.h"
#include ".\Head\Script.h"
#include ".\Head\TempCtr.h"
#include ".\Head\System.h"
#include ".\head\SinoLib.h"

/*-----------------------------*
 *  Macros for constants       *
 *----------------------------*/
#define		BOIL_TEMP_SIZE		12		//临时数据缓冲的大小
#define		BOIL_OFFSET_VAL		1		//判断沸点的偏移值
#define		BOIL_DATA_PER_MIN	12	    //每分钟更新数据数

/*-----------------------------*
 *  Macros for others          *
 *----------------------------*/


/*-----------------------------*
 *  type definitions           *
 *----------------------------*/


/*-----------------------------*
 *  structure,union and enum   *
 *----------------------------*/


/*-----------------------------*
 *  public functions prototypes*
 *----------------------------*/
void 	ScriptProc(void);
//void	BoilCheckProc(void);
#ifdef	DEBUG0
uint8	GetScriptStage(void);
#endif
void	ResetCurScript(void);
void	SetCurScript(uint8 u8ID,uint8 u8texture);
void	SetBotTemp(uint8 code *pScript);
//void	SetPowerLevel(uint8	code *pScript);
void	Heat_Ctr(uint8	code *pScript);
uint8	OtherCmds(uint8	code *pScript);
uint8	ByTemp_ChgStage(uint8 code *pScript);
uint8	ByTime_ChgStage(uint8 code *pScript);
void	ChangeScriptStage(uint8	u8Stage);
void	GetPowerByDT(void);

/*-----------------------------*
 *  static functions prototypes*
 *----------------------------*/


/*-----------------------------*
 *  public variable declaration*
 *----------------------------*/
uint8	code	*m_u8pBaseScript	=	NULL;
uint8	code	*m_u8pScript		=	NULL;
uint8	m_u8ScriptStage		=	0;				//script状态
uint16	m_u16CookTime		=	0;				//烹饪时间,以秒为单位
uint8	m_u8AddOnParam		=	0;				//临时参数
uint8	m_u8AddOffParam		=	0;
uint16	m_u16IntCookTime	=	0;			    //间隔烹饪时间,以秒为单位
uint16	idata	g_u16VarParam[8];               //烹饪可调参数

//火力控制
uint8	idata m_u8OffsetTemp	=	0;				//偏移温度
uint8	idata m_u8TargetTemp	=	0;				//目标温度
uint8	idata m_u8EstimateTemp  =   0;              //预估温度
uint8	idata m_u8PwrCycle		=	0;				//调功周期
uint8	idata m_u8OnTimeInc		=	0;				//加热时间增量
uint8	idata m_u8OnTimeDec		=	0;				//加热时间减量
uint8	idata m_u8MinOnTime_Set	=	0;				//最小加热时间
uint8	idata m_u8MaxOnTime_set	=	0;				//最大加热时间	
                            
//沸腾判断
//uint8	idata   u8BoilTempBuf[BOIL_TEMP_SIZE];	//临时数据缓冲
//uint8	idata	u8BoilTempBufBAK[BOIL_TEMP_SIZE]; //数据备份
//uint8	idata	u8BoilChkCnt	=	0;			
//uint8	idata	m_u8BoilChkTime	=	0;
//uint8	idata	m_u8BoilDegree	=	0;	


uint8	code	m_u8aWhiteRice_Nutritious_Soft[] =
{
	0x05,0x13,0x1E,0x2C,0x3F,
	//------------====== ×′ì? 0 ======-------------
	0x00,0x78,0x82,0xF0,0x05,0x00,          //μ×2????è·??§
	0x05,0xF1,0x00,0x81,          //??a?ê±??′óóú???¨·??óì?×a
	0x03,0x46,0x81,          //?￥2????è′óóú???¨???èì?×a
	0xFF,          //×′ì??áê?
	//------------====== ×′ì? 1 ======-------------
	0x00,0xF1,0xF1,0x0A,0x14,0x00,          //μ×2????è·??§
	0x05,0xF2,0x00,0x82,          //??a?ê±??′óóú???¨·??óì?×a
	0xFF,          //×′ì??áê?
	//------------====== ×′ì? 2 ======-------------
	0x00,0x87,0x8C,0x19,0x05,0x00,          //μ×2????è·??§
	0x03,0x5D,0x83,          //?￥2????è′óóú???¨???èì?×a
	0x05,0x08,0x00,0x83,          //??a?ê±??′óóú???¨·??óì?×a
	0xFF,          //×′ì??áê?
	//------------====== ×′ì? 3 ======-------------
	0x00,0x78,0x82,0xF1,0xF1,0x00,          //μ×2????è·??§
	0x05,0xF5,0x00,0x84,          //??a?ê±??′óóú???¨·??óì?×a
	0x01,0x7D,0x84,          //μ×2????è′óóú???¨???èì?×a
	0x0E,0x03,0x00,0x02,0x00,          //ì?±e??á?
	0xFF,          //×′ì??áê?
	//------------====== ×′ì? 4 ======-------------
	0x00,0x66,0x6E,0x05,0x1E,0x00,          //μ×2????è·??§
	0x0E,0x02,0x00,0x00,0x00,          //ì?±e??á?
	0xFF,          //×′ì??áê?

};

uint8	code	m_u8aWhiteRice_Hard_Normal[] =
{
    0x05,0x13,0x1E,0x2C,0x3A,
	//------------====== 状态 0 ======-------------
	0x00,0x78,0x82,0xF0,0x05,0x00,          //底部温度范围
	0x05,0x06,0x00,0x81,          //烹饪时间大于指定分钟跳转
	0x03,0x46,0x81,          //顶部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x4C,0x4E,0x0A,0x14,0x00,          //底部温度范围
	0x07,0x14,0x00,0x82,          //烹饪时间大于指定秒钟跳转
	0xFF,          //状态结束
	//------------====== 状态 2 ======-------------
	0x00,0x87,0x8C,0xF0,0x05,0x00,          //底部温度范围
	0x03,0x5D,0x83,          //顶部温度大于指定温度跳转
	0x05,0x08,0x00,0x83,          //烹饪时间大于指定分钟跳转
	0xFF,          //状态结束
	//------------====== 状态 3 ======-------------
	0x00,0x78,0x82,0x0A,0x14,0x00,          //底部温度范围
	0x05,0xF5,0x00,0x84,          //烹饪时间大于指定分钟跳转
	0x01,0x7D,0x84,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 4 ======-------------
	0x00,0x66,0x6E,0x05,0x1E,0x00,          //底部温度范围
	0x0E,0x02,0x00,0x00,0x00,          //特别指令
	0xFF,          //状态结束
};

uint8   code    m_u8aBrownRice_Nutritious[] =
{
    0x07,0x15,0x20,0x2E,0x39,0x47,0x55,
	//------------====== 状态 0 ======-------------
	0x00,0x78,0x82,0xF0,0x05,0x00,          //底部温度范围
	0x05,0xF1,0x00,0x81,          //烹饪时间大于指定分钟跳转
	0x03,0x3C,0x81,          //顶部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0xF1,0xF1,0x0A,0x14,0x00,          //底部温度范围
	0x05,0xF2,0x00,0x82,          //烹饪时间大于指定分钟跳转
	0xFF,          //状态结束
	//------------====== 状态 2 ======-------------
	0x00,0x78,0x82,0xF0,0x05,0x00,          //底部温度范围
	0x05,0xF3,0x00,0x83,          //烹饪时间大于指定分钟跳转
	0x03,0x55,0x83,          //顶部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 3 ======-------------
	0x00,0xF2,0xF2,0x0A,0x14,0x00,          //底部温度范围
	0x05,0xF4,0x00,0x84,          //烹饪时间大于指定分钟跳转
	0xFF,          //状态结束
	//------------====== 状态 4 ======-------------
	0x00,0x87,0x8C,0xF0,0x05,0x00,          //底部温度范围
	0x05,0x05,0x00,0x85,          //烹饪时间大于指定分钟跳转
	0x03,0x5D,0x85,          //顶部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 5 ======-------------
	0x00,0x78,0x82,0x14,0x0A,0x00,          //底部温度范围
	0x01,0x7D,0x86,          //底部温度大于指定温度跳转
	0x05,0xF5,0x00,0x86,          //烹饪时间大于指定分钟跳转
	0xFF,          //状态结束
	//------------====== 状态 6 ======-------------
	0x00,0x66,0x6C,0x05,0x1E,0x00,          //底部温度范围
	0x0E,0x02,0x00,0x00,0x00,          //特别指令
	0xFF,          //状态结束

};

uint8   code    m_u8aBrownRice_Hard[] =
{
    0x05,0x13,0x1E,0x2C,0x3A,
	//------------====== 状态 0 ======-------------
	0x00,0x78,0x82,0xF0,0x05,0x00,          //底部温度范围
	0x05,0x06,0x00,0x81,          //烹饪时间大于指定分钟跳转
	0x03,0x3C,0x81,          //顶部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x46,0x48,0x0A,0x14,0x00,          //底部温度范围
	0x07,0x0A,0x00,0x82,          //烹饪时间大于指定秒钟跳转
	0xFF,          //状态结束
	//------------====== 状态 2 ======-------------
	0x00,0x87,0x8C,0xF0,0x05,0x00,          //底部温度范围
	0x05,0x08,0x00,0x83,          //烹饪时间大于指定分钟跳转
	0x03,0x5D,0x83,          //顶部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 3 ======-------------
	0x00,0x78,0x82,0x14,0x0A,0x00,          //底部温度范围
	0x01,0x7D,0x84,          //底部温度大于指定温度跳转
	0x05,0xF5,0x00,0x84,          //烹饪时间大于指定分钟跳转
	0xFF,          //状态结束
	//------------====== 状态 4 ======-------------
	0x00,0x66,0x6C,0x05,0x1E,0x00,          //底部温度范围
	0x0E,0x02,0x00,0x00,0x00,          //特别指令
	0xFF,          //状态结束

};

uint8   code    m_u8aBrownRice_Normal_Soft[] =
{
    0x05,0x13,0x1E,0x2C,0x3A,
	//------------====== 状态 0 ======-------------
	0x00,0x78,0x82,0xF0,0x05,0x00,          //底部温度范围
	0x05,0xF1,0x00,0x81,          //烹饪时间大于指定分钟跳转
	0x03,0x3C,0x81,          //顶部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0xF1,0xF1,0x0A,0x14,0x00,          //底部温度范围
	0x05,0xF2,0x00,0x82,          //烹饪时间大于指定分钟跳转
	0xFF,          //状态结束
	//------------====== 状态 2 ======-------------
	0x00,0x87,0x8C,0xF0,0x05,0x00,          //底部温度范围
	0x05,0x08,0x00,0x83,          //烹饪时间大于指定分钟跳转
	0x03,0x5D,0x83,          //顶部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 3 ======-------------
	0x00,0x78,0x82,0x14,0x0A,0x00,          //底部温度范围
	0x01,0x7D,0x84,          //底部温度大于指定温度跳转
	0x05,0xF5,0x00,0x84,          //烹饪时间大于指定分钟跳转
	0xFF,          //状态结束
	//------------====== 状态 4 ======-------------
	0x00,0x66,0x6C,0x05,0x1E,0x00,          //底部温度范围
	0x0E,0x02,0x00,0x00,0x00,          //特别指令
	0xFF,          //状态结束

};

uint8	code	m_u8aBuckWheat_Nutritious_Soft[] =	
{
	0x06,0x14,0x1F,0x2D,0x38,0x47,
	//------------====== ×′ì? 0 ======-------------
	0x00,0x78,0x82,0xF0,0x05,0x00,          //μ×2????è·??§
	0x05,0xF1,0x00,0x81,          //??a?ê±??′óóú???¨·??óì?×a
	0x03,0x46,0x81,          //?￥2????è′óóú???¨???èì?×a
	0xFF,          //×′ì??áê?
	//------------====== ×′ì? 1 ======-------------
	0x00,0xF1,0xF1,0x14,0x0A,0x00,          //μ×2????è·??§
	0x05,0xF2,0x00,0x82,          //??a?ê±??′óóú???¨·??óì?×a
	0xFF,          //×′ì??áê?
	//------------====== ×′ì? 2 ======-------------
	0x00,0x78,0x82,0xF0,0x05,0x00,          //μ×2????è·??§
	0x03,0x5C,0x83,          //?￥2????è′óóú???¨???èì?×a
	0x05,0x08,0x00,0x83,          //??a?ê±??′óóú???¨·??óì?×a
	0xFF,          //×′ì??áê?
	//------------====== ×′ì? 3 ======-------------
	0x00,0x78,0x82,0x0A,0x14,0x00,          //μ×2????è·??§
	0x05,0xF5,0x00,0x84,          //??a?ê±??′óóú???¨·??óì?×a
	0xFF,          //×′ì??áê?
	//------------====== ×′ì? 4 ======-------------
	0x00,0x78,0x82,0x0A,0x14,0x00,          //μ×2????è·??§
	0x0E,0x02,0x00,0x00,0x00,          //ì?±e??á?
	0x01,0x7D,0x85,          //μ×2????è′óóú???¨???èì?×a
	0xFF,          //×′ì??áê?
	//------------====== ×′ì? 5 ======-------------
	0x0E,0x01,0x00,0x00,0x00,          //ì?±e??á?
	0xFF,          //×′ì??áê?

};

uint8	code	m_u8aBuckWheat_Hard[] =	
{
	0x06,0x14,0x1F,0x2D,0x38,0x47,
	//------------====== ×′ì? 0 ======-------------
	0x00,0x78,0x82,0xF0,0x05,0x00,          //μ×2????è·??§
	0x05,0x06,0x00,0x81,          //??a?ê±??′óóú???¨·??óì?×a
	0x03,0x46,0x81,          //?￥2????è′óóú???¨???èì?×a
	0xFF,          //×′ì??áê?
	//------------====== ×′ì? 1 ======-------------
	0x00,0x4C,0x4E,0x0A,0x14,0x00,          //μ×2????è·??§
	0x07,0x0A,0x00,0x82,          //??a?ê±??′óóú???¨???óì?×a
	0xFF,          //×′ì??áê?
	//------------====== ×′ì? 2 ======-------------
	0x00,0x78,0x82,0xF0,0x05,0x00,          //μ×2????è·??§
	0x03,0x5C,0x83,          //?￥2????è′óóú???¨???èì?×a
	0x05,0x08,0x00,0x83,          //??a?ê±??′óóú???¨·??óì?×a
	0xFF,          //×′ì??áê?
	//------------====== ×′ì? 3 ======-------------
	0x00,0x78,0x82,0x0A,0x14,0x00,          //μ×2????è·??§
	0x05,0xF5,0x00,0x84,          //??a?ê±??′óóú???¨·??óì?×a
	0xFF,          //×′ì??áê?
	//------------====== ×′ì? 4 ======-------------
	0x00,0x78,0x82,0x0A,0x14,0x00,          //μ×2????è·??§
	0x0E,0x02,0x00,0x00,0x00,          //ì?±e??á?
	0x01,0x7D,0x85,          //μ×2????è′óóú???¨???èì?×a
	0xFF,          //×′ì??áê?
	//------------====== ×′ì? 5 ======-------------
	0x0E,0x01,0x00,0x00,0x00,          //ì?±e??á?
	0xFF,          //×′ì??áê?

};

uint8   code    m_u8aQuinoa_Nutritious[] =
{
	0x05,0x0F,0x1A,0x28,0x37,
	//------------====== ×′ì? 0 ======-------------
	0x00,0x28,0x28,0xF0,0x05,0x00,          //μ×2????è·??§
	0x01,0x24,0x81,          //μ×2????è′óóú???¨???èì?×a
	0xFF,          //×′ì??áê?
	//------------====== ×′ì? 1 ======-------------
	0x00,0x26,0x26,0x05,0x19,0x00,          //μ×2????è·??§
	0x05,0x78,0x00,0x82,          //??a?ê±??′óóú???¨·??óì?×a
	0xFF,          //×′ì??áê?
	//------------====== ×′ì? 2 ======-------------
	0x00,0x78,0x82,0xF0,0x05,0x00,          //μ×2????è·??§
	0x05,0x0E,0x00,0x83,          //??a?ê±??′óóú???¨·??óì?×a
	0x03,0x5C,0x83,          //?￥2????è′óóú???¨???èì?×a
	0xFF,          //×′ì??áê?
	//------------====== ×′ì? 3 ======-------------
	0x00,0x78,0x82,0x0A,0x14,0x00,          //μ×2????è·??§
	0x0E,0x02,0x00,0x00,0x00,          //ì?±e??á?
	0x01,0x7D,0x84,          //μ×2????è′óóú???¨???èì?×a
	0xFF,          //×′ì??áê?
	//------------====== ×′ì? 4 ======-------------
	0x0E,0x01,0x00,0x00,0x00,          //ì?±e??á?
	0xFF,          //×′ì??áê?

};

uint8   code    m_u8aQuinoa_Hard_Normal[] =
{
	0x05,0x0F,0x1A,0x28,0x37,
	//------------====== ×′ì? 0 ======-------------
	0x00,0x28,0x28,0xF0,0x05,0x00,          //μ×2????è·??§
	0x01,0x24,0x81,          //μ×2????è′óóú???¨???èì?×a
	0xFF,          //×′ì??áê?
	//------------====== ×′ì? 1 ======-------------
	0x00,0x26,0x26,0x05,0x19,0x00,          //μ×2????è·??§
	0x07,0x0A,0x00,0x82,          //??a?ê±??′óóú???¨???óì?×a
	0xFF,          //×′ì??áê?
	//------------====== ×′ì? 2 ======-------------
	0x00,0x78,0x82,0xF0,0x05,0x00,          //μ×2????è·??§
	0x05,0x10,0x00,0x83,          //??a?ê±??′óóú???¨·??óì?×a
	0x03,0x5C,0x83,          //?￥2????è′óóú???¨???èì?×a
	0xFF,          //×′ì??áê?
	//------------====== ×′ì? 3 ======-------------
	0x00,0x78,0x82,0x0A,0x14,0x00,          //μ×2????è·??§
	0x0E,0x02,0x00,0x00,0x00,          //ì?±e??á?
	0x01,0x7D,0x84,          //μ×2????è′óóú???¨???èì?×a
	0xFF,          //×′ì??áê?
	//------------====== ×′ì? 4 ======-------------
	0x0E,0x01,0x00,0x00,0x00,          //ì?±e??á?
	0xFF,          //×′ì??áê?

};

uint8	code	m_u8aLentils_Nutritious_Hard[] =
{
	0x05,0x13,0x1E,0x2C,0x3A,
	//------------====== ×′ì? 0 ======-------------
	0x00,0x78,0x82,0xF0,0x05,0x00,          //μ×2????è·??§
	0x05,0xF1,0x00,0x81,          //??a?ê±??′óóú???¨·??óì?×a
	0x03,0x3C,0x81,          //?￥2????è′óóú???¨???èì?×a
	0xFF,          //×′ì??áê?
	//------------====== ×′ì? 1 ======-------------
	0x00,0xF1,0xF1,0x0A,0x14,0x00,          //μ×2????è·??§
	0x05,0xF2,0x00,0x82,          //??a?ê±??′óóú???¨·??óì?×a
	0xFF,          //×′ì??áê?
	//------------====== ×′ì? 2 ======-------------
	0x00,0x78,0x82,0xF0,0x05,0x00,          //μ×2????è·??§
	0x05,0x0A,0x00,0x83,          //??a?ê±??′óóú???¨·??óì?×a
	0x03,0x5C,0x83,          //?￥2????è′óóú???¨???èì?×a
	0xFF,          //×′ì??áê?
	//------------====== ×′ì? 3 ======-------------
	0x00,0x78,0x82,0x0C,0x14,0x00,          //μ×2????è·??§
	0x05,0x10,0x00,0x84,          //??a?ê±??′óóú???¨·??óì?×a
	0x01,0x78,0x84,          //μ×2????è′óóú???¨???èì?×a
	0xFF,          //×′ì??áê?
	//------------====== ×′ì? 4 ======-------------
	0x00,0x1E,0x1E,0x05,0x19,0x00,          //μ×2????è·??§
	0x0E,0x02,0x00,0x00,0x00,          //ì?±e??á?
	0xFF,          //×′ì??áê?

};

uint8	code	m_u8aLentils_Soft[] =
{
	0x05,0x13,0x1E,0x2C,0x3A,
	//------------====== ×′ì? 0 ======-------------
	0x00,0x78,0x82,0xF0,0x05,0x00,          //μ×2????è·??§
	0x05,0xF1,0x00,0x81,          //??a?ê±??′óóú???¨·??óì?×a
	0x03,0x3C,0x81,          //?￥2????è′óóú???¨???èì?×a
	0xFF,          //×′ì??áê?
	//------------====== ×′ì? 1 ======-------------
	0x00,0xF1,0xF1,0x0A,0x14,0x00,          //μ×2????è·??§
	0x05,0xF2,0x00,0x82,          //??a?ê±??′óóú???¨·??óì?×a
	0xFF,          //×′ì??áê?
	//------------====== ×′ì? 2 ======-------------
	0x00,0x78,0x82,0xF0,0x05,0x00,          //μ×2????è·??§
	0x05,0x0A,0x00,0x83,          //??a?ê±??′óóú???¨·??óì?×a
	0x03,0x5C,0x83,          //?￥2????è′óóú???¨???èì?×a
	0xFF,          //×′ì??áê?
	//------------====== ×′ì? 3 ======-------------
	0x00,0x78,0x82,0x0C,0x14,0x00,          //μ×2????è·??§
	0x05,0x16,0x00,0x84,          //??a?ê±??′óóú???¨·??óì?×a
	0x01,0x78,0x84,          //μ×2????è′óóú???¨???èì?×a
	0xFF,          //×′ì??áê?
	//------------====== ×′ì? 4 ======-------------
	0x00,0x1E,0x1E,0x05,0x19,0x00,          //μ×2????è·??§
	0x0E,0x02,0x00,0x00,0x00,          //ì?±e??á?
	0xFF,          //×′ì??áê?
	
};

uint8   code    m_u8aBeans_Nutritious_Normal_stage1[] =
{
    0x03,0x0D,0x18,
	//------------====== 状态 0 ======-------------
	0x00,0x82,0x8C,0xF0,0x05,0x00,          //底部温度范围
	0x03,0x5A,0x81,          //顶部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x82,0x8C,0x0C,0x14,0x00,          //底部温度范围
	0x05,0x05,0x00,0x82,          //烹饪时间大于指定分钟跳转
	0xFF,          //状态结束
	//------------====== 状态 2 ======-------------
	0x00,0x46,0x48,0x0A,0x14,0x00,          //底部温度范围
	0x0E,0x02,0x00,0x00,0x00,          //特别指令
	0xFF,          //状态结束

};

uint8   code    m_u8aBeans_Nutritious_stage2[] =
{
	0x03,0x0D,0x1B,
	//------------====== ×′ì? 0 ======-------------
	0x00,0x82,0x8C,0xF0,0x05,0x00,          //μ×2????è·??§
	0x03,0x5C,0x81,          //?￥2????è′óóú???¨???èì?×a
	0xFF,          //×′ì??áê?
	//------------====== ×′ì? 1 ======-------------
	0x00,0x82,0x8C,0x0C,0x14,0x00,          //μ×2????è·??§
	0x01,0x87,0x82,          //μ×2????è′óóú???¨???èì?×a
	0x05,0x78,0x00,0x82,          //??a?ê±??′óóú???¨·??óì?×a
	0xFF,          //×′ì??áê?
	//------------====== ×′ì? 2 ======-------------
	0x00,0x78,0x82,0x06,0x18,0x00,          //μ×2????è·??§
	0x0E,0x02,0x00,0x00,0x00,          //ì?±e??á?
	0xFF,          //×′ì??áê?

};

uint8   code    m_u8aBeans_Normal_stage2[] =
{
	0x03,0x0D,0x1B,
	//------------====== ×′ì? 0 ======-------------
	0x00,0x82,0x8C,0xF0,0x05,0x00,          //μ×2????è·??§
	0x03,0x5C,0x81,          //?￥2????è′óóú???¨???èì?×a
	0xFF,          //×′ì??áê?
	//------------====== ×′ì? 1 ======-------------
	0x00,0x82,0x8C,0x0C,0x14,0x00,          //μ×2????è·??§
	0x01,0x87,0x82,          //μ×2????è′óóú???¨???èì?×a
	0x05,0x3C,0x00,0x82,          //??a?ê±??′óóú???¨·??óì?×a
	0xFF,          //×′ì??áê?
	//------------====== ×′ì? 2 ======-------------
	0x00,0x78,0x82,0x0C,0x14,0x00,          //μ×2????è·??§
	0x0E,0x02,0x00,0x00,0x00,          //ì?±e??á?
	0xFF,          //×′ì??áê?
	
};

uint8	code	m_u8aBabyPorridge[] =
{	
    0x04,0x17,0x2A,0x3A,
	//------------====== 状态 0 ======-------------
	0x00,0x6E,0x7D,0xF0,0x05,0x00,          //底部温度范围
	0x03,0x3C,0x01,          //顶部温度大于指定温度跳转
	0x0E,0x03,0x02,0x3C,0x14,          //特别指令
	0x05,0x0F,0x00,0x01,          //烹饪时间大于指定分钟跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x6E,0x78,0xF1,0xF1,0x00,          //底部温度范围
	0x03,0x5A,0x82,          //顶部温度大于指定温度跳转
	0x0E,0x03,0x03,0x5A,0x02,          //特别指令
	0x05,0x0F,0x00,0x82,          //烹饪时间大于指定分钟跳转
	0xFF,          //状态结束
	//------------====== 状态 2 ======-------------
	0x00,0x28,0x2D,0x05,0x37,0x00,          //底部温度范围
	0x07,0x05,0x00,0x83,          //烹饪时间大于指定秒钟跳转
	0x0E,0x03,0x00,0x00,0x00,          //特别指令
	0xFF,          //状态结束
	//------------====== 状态 3 ======-------------
	0x00,0x60,0x61,0xF2,0xF2,0x00,          //底部温度范围
	0x0E,0x02,0x00,0x00,0x00,          //特别指令
	0xFF,          //状态结束
};

//uint8   code    m_u8aBeans_BrownRice_stage1[] =
//{
//    0x03,0x0D,0x18,
//	//------------====== 状态 0 ======-------------
//	0x00,0x82,0x8C,0xF0,0x05,0x00,          //底部温度范围
//	0x03,0x5A,0x81,          //顶部温度大于指定温度跳转
//	0xFF,          //状态结束
//	//------------====== 状态 1 ======-------------
//	0x00,0x82,0x8C,0x0C,0x14,0x00,          //底部温度范围
//	0x05,0x05,0x00,0x82,          //烹饪时间大于指定分钟跳转
//	0xFF,          //状态结束
//	//------------====== 状态 2 ======-------------
//	0x00,0x46,0x48,0x0A,0x14,0x00,          //底部温度范围
//	0x0E,0x02,0x00,0x00,0x00,          //特别指令
//	0xFF,          //状态结束
//};

//uint8   code    m_u8aBeans_BrownRice_stage2[] =
//{
//    0x02,0x0C,
//	//------------====== 状态 0 ======-------------
//	0x00,0x82,0x8C,0xF0,0x05,0x00,          //底部温度范围
//	0x03,0x5A,0x81,          //顶部温度大于指定温度跳转
//	0xFF,          //状态结束
//	//------------====== 状态 1 ======-------------
//	0x00,0x82,0x8C,0x0C,0x14,0x00,          //底部温度范围
//	0x0E,0x02,0x00,0x00,0x00,          //特别指令
//	0xFF,          //状态结束
//};

uint8   code    m_u8aBrownRice_Lentiles[] =
{
	0x06,0x14,0x1F,0x2D,0x3B,0x4A,
	//------------====== ×′ì? 0 ======-------------
	0x00,0x78,0x82,0x1E,0x05,0x00,          //μ×2????è·??§
	0x05,0xF1,0x00,0x81,          //??a?ê±??′óóú???¨·??óì?×a
	0x03,0x4B,0x81,          //?￥2????è′óóú???¨???èì?×a
	0xFF,          //×′ì??áê?
	//------------====== ×′ì? 1 ======-------------
	0x00,0xF1,0xF1,0x0A,0x14,0x00,          //μ×2????è·??§
	0x05,0xF2,0x00,0x82,          //??a?ê±??′óóú???¨·??óì?×a
	0xFF,          //×′ì??áê?
	//------------====== ×′ì? 2 ======-------------
	0x00,0x78,0x82,0xF0,0x05,0x00,          //μ×2????è·??§
	0x05,0x08,0x00,0x83,          //??a?ê±??′óóú???¨·??óì?×a
	0x03,0x5C,0x83,          //?￥2????è′óóú???¨???èì?×a
	0xFF,          //×′ì??áê?
	//------------====== ×′ì? 3 ======-------------
	0x00,0x78,0x82,0x0F,0x0F,0x00,          //μ×2????è·??§
	0x01,0x78,0x84,          //μ×2????è′óóú???¨???èì?×a
	0x05,0x0F,0x00,0x84,          //??a?ê±??′óóú???¨·??óì?×a
	0xFF,          //×′ì??áê?
	//------------====== ×′ì? 4 ======-------------
	0x00,0x1E,0x1E,0x05,0x19,0x00,          //μ×2????è·??§
	0x01,0x82,0x85,          //μ×2????è′óóú???¨???èì?×a
	0x0E,0x02,0x00,0x00,0x00,          //ì?±e??á?
	0xFF,          //×′ì??áê?
	//------------====== ×′ì? 5 ======-------------
	0x0E,0x01,0x00,0x00,0x00,          //ì?±e??á?
	0xFF,          //×′ì??áê?
};

uint8   code    m_u8aChickPeas_stage1[] =
{
    0x03,0x0D,0x18,
	//------------====== 状态 0 ======-------------
	0x00,0x82,0x8C,0xF0,0x05,0x00,          //底部温度范围
	0x03,0x5A,0x81,          //顶部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x82,0x8C,0x0C,0x14,0x00,          //底部温度范围
	0x05,0x05,0x00,0x82,          //烹饪时间大于指定分钟跳转
	0xFF,          //状态结束
	//------------====== 状态 2 ======-------------
	0x00,0x46,0x48,0x0A,0x14,0x00,          //底部温度范围
	0x0E,0x02,0x00,0x00,0x00,          //特别指令
	0xFF,          //状态结束
};

uint8   code    m_u8aChickPeas_stage2[] =
{
	0x02,0x0C,
	//------------====== 状态 0 ======-------------
	0x00,0x82,0x8C,0xF0,0x05,0x00,          //底部温度范围
	0x03,0x5A,0x81,          //顶部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x82,0x8C,0x0C,0x14,0x00,          //底部温度范围
	0x0E,0x02,0x00,0x00,0x00,          //特别指令
	0xFF,          //状态结束
};

uint8   code    m_u8aRisotto[] =
{
    0x09,0x17,0x22,0x35,0x48,0x5B,0x6E,0x81,0x8C,
	//------------====== 状态 0 ======-------------
	0x00,0x55,0x5A,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x41,0x81,          //底部温度大于指定温度跳转
	0x05,0x0A,0x00,0x81,          //烹饪时间大于指定分钟跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x3C,0x41,0x0F,0x1E,0x00,          //底部温度范围
	0x05,0x08,0x00,0x82,          //烹饪时间大于指定分钟跳转
	0xFF,          //状态结束
	//------------====== 状态 2 ======-------------
	0x00,0x78,0x82,0xF0,0x05,0x00,          //底部温度范围
	0x03,0x37,0x03,          //顶部温度大于指定温度跳转
	0x0E,0x03,0x02,0x37,0x14,          //特别指令
	0x05,0x28,0x00,0x03,          //烹饪时间大于指定分钟跳转
	0xFF,          //状态结束
	//------------====== 状态 3 ======-------------
	0x00,0x78,0x82,0xF1,0xF1,0x00,          //底部温度范围
	0x03,0x52,0x84,          //顶部温度大于指定温度跳转
	0x0E,0x03,0x03,0x55,0x01,          //特别指令
	0x05,0x28,0x00,0x84,          //烹饪时间大于指定分钟跳转
	0xFF,          //状态结束
	//------------====== 状态 4 ======-------------
	0x00,0x78,0x82,0xF1,0xF1,0x00,          //底部温度范围
	0x03,0x5C,0x85,          //顶部温度大于指定温度跳转
	0x0E,0x03,0x03,0x62,0x01,          //特别指令
	0x05,0x0C,0x00,0x85,          //烹饪时间大于指定分钟跳转
	0xFF,          //状态结束
	//------------====== 状态 5 ======-------------
	0x00,0x82,0x87,0xF1,0xF1,0x00,          //底部温度范围
	0x01,0x82,0x87,          //底部温度大于指定温度跳转
	0x05,0x08,0x00,0x86,          //烹饪时间大于指定分钟跳转
	0x0E,0x03,0x00,0x01,0x00,          //特别指令
	0xFF,          //状态结束
	//------------====== 状态 6 ======-------------
	0x00,0x82,0x87,0xF1,0xF1,0x00,          //底部温度范围
	0x01,0x82,0x87,          //底部温度大于指定温度跳转
	0x05,0x0A,0x00,0x87,          //烹饪时间大于指定分钟跳转
	0x0E,0x03,0x00,0x02,0x00,          //特别指令
	0xFF,          //状态结束
	//------------====== 状态 7 ======-------------
	0x00,0x62,0x64,0x0A,0x1E,0x00,          //底部温度范围
	0x05,0x0E,0x00,0x88,          //烹饪时间大于指定分钟跳转
	0xFF,          //状态结束
	//------------====== 状态 8 ======-------------
	0x0E,0x01,0x00,0x00,0x00,          //特别指令
	0xFF,          //状态结束
};

//蒸煮
uint8	code	m_u8aSteam[] =	
{
    0x03,0x10,0x1D,
	//------------====== 状态 0 ======-------------
	0x00,0x82,0x8C,0xF0,0x05,0x00,          //底部温度范围
	0x03,0x5A,0x01,          //顶部温度大于指定温度跳转
	0x01,0x8C,0x02,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x82,0x8C,0x1E,0x14,0x00,          //底部温度范围
	0x04,0x58,0x00,          //顶部温度小于指定温度跳转
	0x01,0x8C,0x02,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 2 ======-------------
	0x0E,0x01,0x00,0x00,0x00,          //特别指令
	0xFF,          //状态结束

};

uint8	code	m_u8aSlowcook[] = 
{
    0x02,0x0C,
	//------------====== 状态 0 ======-------------
	0x00,0x64,0x64,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x58,0x01,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x64,0x64,0x0A,0x14,0x00,          //底部温度范围
	0x02,0x55,0x00,          //底部温度小于指定温度跳转
	0xFF,          //状态结束
};

uint8   code    m_u8aSoup[] =
{
	0x02,0x0C,
	//------------====== 状态 0 ======-------------
	0x00,0x82,0x8C,0xF0,0x05,0x00,          //底部温度范围
	0x03,0x5A,0x01,          //顶部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x82,0x8C,0x0C,0x14,0x00,          //底部温度范围
	0x04,0x58,0x00,          //顶部温度小于指定温度跳转
	0xFF,          //状态结束
};

uint8   code    m_u8aPasta[] =
{
	0x03,0x0D,0x19,
	//------------====== 状态 0 ======-------------
	0x00,0x82,0x8C,0xF0,0x05,0x00,          //底部温度范围
	0x03,0x58,0x01,          //顶部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x82,0x8C,0x14,0x14,0x00,          //底部温度范围
	0x0E,0x04,0x00,0x00,0x01,          //特别指令
	0xFF,          //状态结束
	//------------====== 状态 2 ======-------------
	0x00,0x5F,0x60,0x05,0x19,0x00,          //底部温度范围
	0xFF,          //状态结束
};

uint8   code    m_u8aCreamcheese[] =
{
    0x03,0x10,0x1A,
	//------------====== 状态 0 ======-------------
	0x00,0x78,0x7D,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x50,0x01,          //底部温度大于指定温度跳转
	0x03,0x32,0x02,          //顶部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x70,0x72,0x0F,0x15,0x00,          //底部温度范围
	0x03,0x37,0x02,          //顶部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 2 ======-------------
	0x00,0x50,0x50,0x0A,0x14,0x00,          //底部温度范围
	0xFF,          //状态结束
};

uint8	code	m_u8aYoghurt[] = 
{
	0x02,0x0C,
	//------------====== 状态 0 ======-------------
	0x00,0x26,0x26,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x1E,0x01,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x25,0x25,0x05,0x19,0x00,          //底部温度范围
	0x02,0x1C,0x00,          //底部温度小于指定温度跳转
	0xFF,          //状态结束
};

uint8   code    m_u8aJam[] =
{
    0x03,0x10,0x1D,
	//------------====== 状态 0 ======-------------
	0x00,0x82,0x8C,0xF0,0x05,0x00,          //底部温度范围
	0x03,0x5A,0x01,          //顶部温度大于指定温度跳转
	0x01,0x8C,0x02,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x82,0x8C,0x0F,0x0F,0x00,          //底部温度范围
	0x04,0x58,0x00,          //顶部温度小于指定温度跳转
	0x01,0x8C,0x02,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 2 ======-------------
	0x0E,0x01,0x00,0x00,0x00,          //特别指令
	0xFF,          //状态结束
};

uint8	code	m_u8aReheat_80[] = 
{
	0x03,0x10,0x1A,
	//------------====== 状态 0 ======-------------
	0x00,0x78,0x7D,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x50,0x01,          //底部温度大于指定温度跳转
	0x03,0x32,0x02,          //顶部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x70,0x72,0x0F,0x15,0x00,          //底部温度范围
	0x03,0x32,0x02,          //顶部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 2 ======-------------
	0x00,0x4E,0x4E,0x0A,0x14,0x00,          //底部温度范围
	0xFF,          //状态结束
};

uint8	code	m_u8aReheat_100[] = 
{
	0x03,0x10,0x1A,
	//------------====== 状态 0 ======-------------
	0x00,0x78,0x7D,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x5A,0x01,          //底部温度大于指定温度跳转
	0x03,0x56,0x02,          //顶部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x70,0x72,0x0F,0x15,0x00,          //底部温度范围
	0x03,0x56,0x02,          //顶部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 2 ======-------------
	0x00,0x62,0x64,0x0C,0x18,0x00,          //底部温度范围
	0xFF,          //状态结束
};

uint8	code	m_u8aTemp_30[] =
{
	0x02,0x0C,
	//------------====== 状态 0 ======-------------
	0x00,0x1E,0x1E,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x18,0x01,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x1E,0x1E,0x05,0x19,0x00,          //底部温度范围
	0x02,0x16,0x00,          //底部温度小于指定温度跳转
	0xFF,          //状态结束
};

uint8	code	m_u8aTemp_40[] =
{
	0x02,0x0C,
	//------------====== 状态 0 ======-------------
	0x00,0x28,0x28,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x20,0x01,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x28,0x28,0x05,0x19,0x00,          //底部温度范围
	0x02,0x1E,0x00,          //底部温度小于指定温度跳转
	0xFF,          //状态结束
};

uint8	code	m_u8aTemp_45[] =
{
	0x02,0x0C,
	//------------====== 状态 0 ======-------------
	0x00,0x2D,0x2D,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x25,0x01,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x2D,0x2D,0x05,0x19,0x00,          //底部温度范围
	0x02,0x23,0x00,          //底部温度小于指定温度跳转
	0xFF,          //状态结束
};

uint8	code	m_u8aTemp_50[] =
{
	0x02,0x0C,
	//------------====== 状态 0 ======-------------
	0x00,0x32,0x32,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x2A,0x01,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x32,0x32,0x05,0x19,0x00,          //底部温度范围
	0x02,0x28,0x00,          //底部温度小于指定温度跳转
	0xFF,          //状态结束
};

uint8	code	m_u8aTemp_55[] =
{
	0x02,0x0C,
	//------------====== 状态 0 ======-------------
	0x00,0x37,0x37,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x2F,0x01,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x37,0x37,0x05,0x19,0x00,          //底部温度范围
	0x02,0x2D,0x00,          //底部温度小于指定温度跳转
	0xFF,          //状态结束
};

uint8	code	m_u8aTemp_60[] =
{
	0x02,0x0C,
	//------------====== 状态 0 ======-------------
	0x00,0x3C,0x3C,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x34,0x01,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x3C,0x3C,0x05,0x19,0x00,          //底部温度范围
	0x02,0x32,0x00,          //底部温度小于指定温度跳转
	0xFF,          //状态结束
};

uint8	code	m_u8aTemp_65[] =
{
	0x02,0x0C,
	//------------====== 状态 0 ======-------------
	0x00,0x41,0x41,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x39,0x01,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x40,0x40,0x05,0x19,0x00,          //底部温度范围
	0x02,0x37,0x00,          //底部温度小于指定温度跳转
	0xFF,          //状态结束
};

uint8	code	m_u8aTemp_70[] =
{
	0x02,0x0C,
	//------------====== 状态 0 ======-------------
	0x00,0x46,0x46,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x3E,0x01,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x45,0x45,0x05,0x19,0x00,          //底部温度范围
	0x02,0x3C,0x00,          //底部温度小于指定温度跳转
	0xFF,          //状态结束
};

uint8	code	m_u8aTemp_75[] =
{
	0x02,0x0C,
	//------------====== 状态 0 ======-------------
	0x00,0x4B,0x4B,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x43,0x01,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x4A,0x4A,0x05,0x19,0x00,          //底部温度范围
	0x02,0x41,0x00,          //底部温度小于指定温度跳转
	0xFF,          //状态结束
};

uint8	code	m_u8aTemp_80[] =
{
	0x02,0x0C,
	//------------====== 状态 0 ======-------------
	0x00,0x50,0x50,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x48,0x01,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x4E,0x4E,0x05,0x19,0x00,          //底部温度范围
	0x02,0x46,0x00,          //底部温度小于指定温度跳转
	0xFF,          //状态结束
};

uint8	code	m_u8aTemp_85[] =
{
	0x02,0x0C,
	//------------====== 状态 0 ======-------------
	0x00,0x55,0x55,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x4D,0x01,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x53,0x53,0x05,0x19,0x00,          //底部温度范围
	0x02,0x4B,0x00,          //底部温度小于指定温度跳转
	0xFF,          //状态结束
};

uint8	code	m_u8aTemp_90[] =
{
	0x02,0x0C,
	//------------====== 状态 0 ======-------------
	0x00,0x5A,0x5A,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x50,0x01,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x58,0x58,0x05,0x19,0x00,          //底部温度范围
	0x02,0x4F,0x00,          //底部温度小于指定温度跳转
	0xFF,          //状态结束
};

uint8	code	m_u8aTemp_95[] =
{
	0x02,0x0C,
	//------------====== 状态 0 ======-------------
	0x00,0x5F,0x5F,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x55,0x01,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x5D,0x5D,0x05,0x19,0x00,          //底部温度范围
	0x02,0x54,0x00,          //底部温度小于指定温度跳转
	0xFF,          //状态结束
};

uint8	code	m_u8aTemp_Water_100[] =
{
	0x02,0x0C,
	//------------====== 状态 0 ======-------------
	0x00,0x64,0x64,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x58,0x01,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x64,0x64,0x0A,0x14,0x00,          //底部温度范围
	0x02,0x55,0x00,          //底部温度小于指定温度跳转
	0xFF,          //状态结束
};

uint8	code	m_u8aTemp_Oil_100[] =
{
	0x05,0x0F,0x1A,0x24,0x2E,
	//------------====== 状态 0 ======-------------
	0x00,0x61,0x62,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x50,0x81,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x2E,0x30,0x02,0x1C,0x00,          //底部温度范围
	0x07,0x1E,0x00,0x02,          //烹饪时间大于指定秒钟跳转
	0xFF,          //状态结束
	//------------====== 状态 2 ======-------------
	0x00,0x61,0x62,0x0A,0x0A,0x00,          //底部温度范围
	0x01,0x5D,0x04,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 3 ======-------------
	0x00,0x61,0x62,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x5D,0x04,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 4 ======-------------
	0x00,0x61,0x62,0xF3,0xF4,0x00,          //底部温度范围
	0x02,0x5D,0x03,          //底部温度小于指定温度跳转
	0xFF,          //状态结束
};

uint8	code	m_u8aTemp_105[] =
{
    0x05,0x0F,0x1A,0x24,0x2E,
	//------------====== 状态 0 ======-------------
	0x00,0x63,0x64,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x52,0x81,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x2E,0x30,0x02,0x1C,0x00,          //底部温度范围
	0x07,0x1E,0x00,0x02,          //烹饪时间大于指定秒钟跳转
	0xFF,          //状态结束
	//------------====== 状态 2 ======-------------
	0x00,0x63,0x64,0x0A,0x0A,0x00,          //底部温度范围
	0x01,0x5F,0x04,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 3 ======-------------
	0x00,0x63,0x64,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x5F,0x04,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 4 ======-------------
	0x00,0x63,0x64,0xF3,0xF4,0x00,          //底部温度范围
	0x02,0x5F,0x03,          //底部温度小于指定温度跳转
	0xFF,          //状态结束
};

uint8	code	m_u8aTemp_110[] =
{
	0x05,0x0F,0x1A,0x24,0x2E,
	//------------====== 状态 0 ======-------------
	0x00,0x65,0x66,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x55,0x81,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x2E,0x30,0x02,0x1C,0x00,          //底部温度范围
	0x07,0x1E,0x00,0x02,          //烹饪时间大于指定秒钟跳转
	0xFF,          //状态结束
	//------------====== 状态 2 ======-------------
	0x00,0x65,0x66,0x0A,0x0A,0x00,          //底部温度范围
	0x01,0x61,0x04,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 3 ======-------------
	0x00,0x65,0x66,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x61,0x04,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 4 ======-------------
	0x00,0x65,0x66,0xF3,0xF4,0x00,          //底部温度范围
	0x02,0x61,0x03,          //底部温度小于指定温度跳转
	0xFF,          //状态结束
};

uint8	code	m_u8aTemp_115[] =
{
    0x05,0x0F,0x1A,0x24,0x2E,
	//------------====== 状态 0 ======-------------
	0x00,0x6A,0x6B,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x5A,0x81,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x2E,0x30,0x02,0x1C,0x00,          //底部温度范围
	0x07,0x1E,0x00,0x02,          //烹饪时间大于指定秒钟跳转
	0xFF,          //状态结束
	//------------====== 状态 2 ======-------------
	0x00,0x6A,0x6B,0x0A,0x0A,0x00,          //底部温度范围
	0x01,0x66,0x04,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 3 ======-------------
	0x00,0x6A,0x6B,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x66,0x04,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 4 ======-------------
	0x00,0x6A,0x6B,0xF3,0xF4,0x00,          //底部温度范围
	0x02,0x66,0x03,          //底部温度小于指定温度跳转
	0xFF,          //状态结束
};

uint8	code	m_u8aTemp_120[] =
{
	0x05,0x0F,0x1A,0x24,0x2E,
	//------------====== 状态 0 ======-------------
	0x00,0x6F,0x70,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x5A,0x81,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x2E,0x30,0x02,0x1C,0x00,          //底部温度范围
	0x07,0x1E,0x00,0x02,          //烹饪时间大于指定秒钟跳转
	0xFF,          //状态结束
	//------------====== 状态 2 ======-------------
	0x00,0x6F,0x70,0x0A,0x0A,0x00,          //底部温度范围
	0x01,0x6B,0x04,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 3 ======-------------
	0x00,0x6F,0x70,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x6B,0x04,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 4 ======-------------
	0x00,0x6F,0x70,0xF3,0xF4,0x00,          //底部温度范围
	0x02,0x6B,0x03,          //底部温度小于指定温度跳转
	0xFF,          //状态结束
};

uint8	code	m_u8aTemp_125[] =
{
    0x05,0x0F,0x1A,0x24,0x2E,
	//------------====== 状态 0 ======-------------
	0x00,0x74,0x75,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x5F,0x81,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x2E,0x30,0x02,0x1C,0x00,          //底部温度范围
	0x07,0x1E,0x00,0x02,          //烹饪时间大于指定秒钟跳转
	0xFF,          //状态结束
	//------------====== 状态 2 ======-------------
	0x00,0x74,0x75,0x0A,0x0A,0x00,          //底部温度范围
	0x01,0x70,0x04,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 3 ======-------------
	0x00,0x74,0x75,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x70,0x04,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 4 ======-------------
	0x00,0x74,0x75,0xF3,0xF4,0x00,          //底部温度范围
	0x02,0x70,0x03,          //底部温度小于指定温度跳转
	0xFF,          //状态结束
};

uint8	code	m_u8aTemp_130[] =
{
    0x05,0x0F,0x1A,0x24,0x2E,
	//------------====== 状态 0 ======-------------
	0x00,0x79,0x7A,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x5F,0x81,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x2E,0x30,0x02,0x1C,0x00,          //底部温度范围
	0x07,0x1E,0x00,0x02,          //烹饪时间大于指定秒钟跳转
	0xFF,          //状态结束
	//------------====== 状态 2 ======-------------
	0x00,0x79,0x7A,0x0A,0x0A,0x00,          //底部温度范围
	0x01,0x75,0x04,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 3 ======-------------
	0x00,0x79,0x7A,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x75,0x04,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 4 ======-------------
	0x00,0x79,0x7A,0xF3,0xF4,0x00,          //底部温度范围
	0x02,0x75,0x03,          //底部温度小于指定温度跳转
	0xFF,          //状态结束
};

uint8	code	m_u8aTemp_135[] =
{
    0x05,0x0F,0x1A,0x24,0x2E,
	//------------====== 状态 0 ======-------------
	0x00,0x7E,0x7F,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x64,0x81,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x2E,0x30,0x02,0x1C,0x00,          //底部温度范围
	0x07,0x1E,0x00,0x02,          //烹饪时间大于指定秒钟跳转
	0xFF,          //状态结束
	//------------====== 状态 2 ======-------------
	0x00,0x7E,0x7F,0x0A,0x0A,0x00,          //底部温度范围
	0x01,0x7A,0x04,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 3 ======-------------
	0x00,0x7E,0x7F,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x7A,0x04,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 4 ======-------------
	0x00,0x7E,0x7F,0xF3,0xF4,0x00,          //底部温度范围
	0x02,0x7A,0x03,          //底部温度小于指定温度跳转
	0xFF,          //状态结束
};

uint8   code    m_u8aTemp_140[] =
{
    0x05,0x0F,0x1A,0x24,0x2E,
	//------------====== 状态 0 ======-------------
	0x00,0x82,0x83,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x64,0x81,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x2E,0x30,0x02,0x1C,0x00,          //底部温度范围
	0x07,0x1E,0x00,0x02,          //烹饪时间大于指定秒钟跳转
	0xFF,          //状态结束
	//------------====== 状态 2 ======-------------
	0x00,0x82,0x83,0x0A,0x0A,0x00,          //底部温度范围
	0x01,0x7E,0x04,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 3 ======-------------
	0x00,0x82,0x83,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x7E,0x04,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 4 ======-------------
	0x00,0x82,0x83,0xF3,0xF4,0x00,          //底部温度范围
	0x02,0x7E,0x03,          //底部温度小于指定温度跳转
	0xFF,          //状态结束
};

uint8   code    m_u8aTemp_145[] =
{
    0x05,0x0F,0x1A,0x24,0x2E,
	//------------====== 状态 0 ======-------------
	0x00,0x87,0x88,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x69,0x81,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x2E,0x30,0x02,0x1C,0x00,          //底部温度范围
	0x07,0x1E,0x00,0x02,          //烹饪时间大于指定秒钟跳转
	0xFF,          //状态结束
	//------------====== 状态 2 ======-------------
	0x00,0x87,0x88,0x0A,0x0A,0x00,          //底部温度范围
	0x01,0x83,0x04,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 3 ======-------------
	0x00,0x87,0x88,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x83,0x04,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 4 ======-------------
	0x00,0x87,0x88,0xF3,0xF4,0x00,          //底部温度范围
	0x02,0x83,0x03,          //底部温度小于指定温度跳转
	0xFF,          //状态结束
};

uint8	code	m_u8aTemp_150[] =
{
    0x05,0x0F,0x1A,0x24,0x2E,
	//------------====== 状态 0 ======-------------
	0x00,0x8C,0x8D,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x6E,0x81,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x2E,0x30,0x02,0x1C,0x00,          //底部温度范围
	0x07,0x1E,0x00,0x02,          //烹饪时间大于指定秒钟跳转
	0xFF,          //状态结束
	//------------====== 状态 2 ======-------------
	0x00,0x8C,0x8D,0x0A,0x0A,0x00,          //底部温度范围
	0x01,0x88,0x04,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 3 ======-------------
	0x00,0x8C,0x8D,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x88,0x04,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 4 ======-------------
	0x00,0x8C,0x8D,0xF3,0xF4,0x00,          //底部温度范围
	0x02,0x88,0x03,          //底部温度小于指定温度跳转
	0xFF,          //状态结束
};

uint8	code	m_u8aTemp_155[] =
{
    0x05,0x0F,0x1A,0x24,0x2E,
	//------------====== 状态 0 ======-------------
	0x00,0x91,0x92,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x73,0x81,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x2E,0x30,0x02,0x1C,0x00,          //底部温度范围
	0x07,0x1E,0x00,0x02,          //烹饪时间大于指定秒钟跳转
	0xFF,          //状态结束
	//------------====== 状态 2 ======-------------
	0x00,0x91,0x92,0x0A,0x0A,0x00,          //底部温度范围
	0x01,0x8D,0x04,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 3 ======-------------
	0x00,0x91,0x92,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x8D,0x04,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 4 ======-------------
	0x00,0x91,0x92,0xF3,0xF4,0x00,          //底部温度范围
	0x02,0x8D,0x03,          //底部温度小于指定温度跳转
	0xFF,          //状态结束
};

uint8	code	m_u8aTemp_160[] =
{
    0x05,0x0F,0x1A,0x24,0x2E,
	//------------====== 状态 0 ======-------------
	0x00,0x96,0x97,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x78,0x81,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 1 ======-------------
	0x00,0x2E,0x30,0x02,0x1C,0x00,          //底部温度范围
	0x07,0x1E,0x00,0x02,          //烹饪时间大于指定秒钟跳转
	0xFF,          //状态结束
	//------------====== 状态 2 ======-------------
	0x00,0x96,0x97,0x0A,0x0A,0x00,          //底部温度范围
	0x01,0x92,0x04,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 3 ======-------------
	0x00,0x96,0x97,0xF0,0x05,0x00,          //底部温度范围
	0x01,0x92,0x04,          //底部温度大于指定温度跳转
	0xFF,          //状态结束
	//------------====== 状态 4 ======-------------
	0x00,0x96,0x97,0xF3,0xF4,0x00,          //底部温度范围
	0x02,0x92,0x03,          //底部温度小于指定温度跳转
	0xFF,          //状态结束
};

/*-----------------------------*
 *  static variable declaration*
 *----------------------------*/



#ifdef	DEBUG0
/*-----------------------------------------------------------------------------*
 *  Function Description:                                                      *
 *      查询当前状态位置                                   				       *
 *  Parameters:                                                                *
 *      None                                                                   *
 *  Return                                                                     *
 *      m_u8ScriptStage                                                        *
 *----------------------------------------------------------------------------*/
uint8	GetScriptStage(void)
{
	return	m_u8ScriptStage;
}
#endif

/*-----------------------------------------------------------------------------*
 *  Function Description:                                                      *
 *      复位当前Script参数                                   				   *
 *  Parameters:                                                                *
 *      None                                                                   *
 *  Return                                                                     *
 *      None                                                                   *
 *----------------------------------------------------------------------------*/
void	ResetCurScript(void)
{  
     m_u8ScriptStage	=	0;
     m_u8pScript		=	NULL;
     bCookBySctEN		=	0;			//禁止Script运行
	 bBoilChk_EN		=	0;	   		//取消沸腾判断
//	 bStageChgReq       =   0;
//	 bStageChgOK        =   0;
	 bBoilReach			=	0;
//	 u8BoilChkCnt		=	0;
//	 m_u8BoilChkTime	=	0;
//	 m_u8BoilDegree		=	0;
     m_u16CookTime		=	0;
	 m_u16IntCookTime	=	0;
	 g_u16RelayTime		=	0;
	 m_u8AddOnParam		=	0;			//临时参数清零
	 m_u8AddOffParam	=	0;
     bTempAch1st        =   0;
     bTimeCountDown     =   0;
	 m_u8ChkCnt         =   0;
}

/*-----------------------------------------------------------------------------*
 *  Function Description:                                                      *
 *      设置功能地址                                   				           *
 *  Parameters:                                                                *
 *      None                                                                   *
 *  Return                                                                     *
 *      None                                                                   *
 *----------------------------------------------------------------------------*/
void	SetCurScript(uint8 u8ID,uint8 u8texture)
{
	switch(u8ID)
	{
        //Nutritious menus(01-09)
		case 	FUNC_ID_WHITERICE:	
            if((u8texture==TEXTURE_ID_NUTRITIOUS)||(u8texture==TEXTURE_ID_SOFT))
            {
                m_u8pBaseScript = (uint8 code *)m_u8aWhiteRice_Nutritious_Soft;
            }
            if((u8texture==TEXTURE_ID_HARD)||(u8texture==TEXTURE_ID_NORMAL))
            {
                m_u8pBaseScript = (uint8 code *)m_u8aWhiteRice_Hard_Normal;
            }
            break;
		case 	FUNC_ID_BROWNRICE:           
            if(u8texture==TEXTURE_ID_NUTRITIOUS) m_u8pBaseScript = (uint8 code *)m_u8aBrownRice_Nutritious;
            if(u8texture==TEXTURE_ID_HARD) m_u8pBaseScript = (uint8 code *)m_u8aBrownRice_Hard;
            if((u8texture==TEXTURE_ID_NORMAL)||(u8texture==TEXTURE_ID_SOFT))
            {
                m_u8pBaseScript = (uint8 code *)m_u8aBrownRice_Normal_Soft;
            }
            break;
        case	FUNC_ID_BUCKWHEAT:
            if((u8texture==TEXTURE_ID_NUTRITIOUS)||(u8texture==TEXTURE_ID_SOFT))
            {
                m_u8pBaseScript = (uint8 code *)m_u8aBuckWheat_Nutritious_Soft;
            }
            if(u8texture==TEXTURE_ID_HARD) m_u8pBaseScript = (uint8 code *)m_u8aBuckWheat_Hard;
            break;
		case	FUNC_ID_QUINOA:
            if(u8texture==TEXTURE_ID_NUTRITIOUS) m_u8pBaseScript = (uint8 code *)m_u8aQuinoa_Nutritious; 
            if((u8texture==TEXTURE_ID_HARD)||(u8texture==TEXTURE_ID_NORMAL))
            {
                m_u8pBaseScript = (uint8 code *)m_u8aQuinoa_Hard_Normal;
            }
            break;
		case	FUNC_ID_LENTILS:
			if((u8texture==TEXTURE_ID_NUTRITIOUS)||(u8texture==TEXTURE_ID_HARD))
			{
				m_u8pBaseScript = (uint8 code *)m_u8aLentils_Nutritious_Hard;
			}
			if(u8texture==TEXTURE_ID_SOFT) m_u8pBaseScript = (uint8 code *)m_u8aLentils_Soft;
            break;
		case	FUNC_ID_BEANS:
            if(bStageChgReq==0)
            {
                m_u8pBaseScript =  (uint8 code *)m_u8aBeans_Nutritious_Normal_stage1;
            }
            else
            {
				if(u8texture==TEXTURE_ID_NUTRITIOUS) m_u8pBaseScript = (uint8 code *)m_u8aBeans_Nutritious_stage2;
                if(u8texture==TEXTURE_ID_NORMAL)     m_u8pBaseScript = (uint8 code *)m_u8aBeans_Normal_stage2;
            }
            break;		
		case 	FUNC_ID_BABYPORRIDGE:
			 m_u8pBaseScript = (uint8 code *)m_u8aBabyPorridge;
			break;
//        case    FUNC_ID_BEANS_BROWNRICE:
//            if(bStageChgReq==0)
//            {
//                m_u8pBaseScript =  (uint8 code *)m_u8aBeans_BrownRice_stage1;
//            }
//            else
//            {
//                m_u8pBaseScript	=  (uint8 code *)m_u8aBeans_BrownRice_stage2;
//            }
//            break;
        case    FUNC_ID_BROWNRICE_LENTILS:
            m_u8pBaseScript	=	(uint8 code	*)m_u8aBrownRice_Lentiles; 
            break;
        case    FUNC_ID_CHICKPEAS:
            if(bStageChgReq==0)
            {
                m_u8pBaseScript =  (uint8 code *)m_u8aChickPeas_stage1;
            }
            else
            {
                m_u8pBaseScript	=  (uint8 code *)m_u8aChickPeas_stage2;
            }
            break; 
            
        //Classical menus(10-21)
        case    FUNC_ID_RISOTTO:
            m_u8pBaseScript =  (uint8 code *)m_u8aRisotto;
            break;;
        case	FUNC_ID_STEAM:
            m_u8pBaseScript	=	(uint8 code *)m_u8aSteam;
			break;	
        case	FUNC_ID_SLOWCOOK:
            if(u8CookTemp==80)  m_u8pBaseScript = (uint8 code *)m_u8aTemp_80;
			if(u8CookTemp==90)  m_u8pBaseScript = (uint8 code *)m_u8aTemp_90;
			if(u8CookTemp==100) m_u8pBaseScript = (uint8 code *)m_u8aSlowcook;
			break;
        case	FUNC_ID_BAKING:
		case	FUNC_ID_BROWNING:
		case	FUNC_ID_DESSERT:
		case	FUNC_ID_DIY:
			if(u8CookTemp==40)  m_u8pBaseScript = (uint8 code *)m_u8aTemp_40;
            if(u8CookTemp==45)  m_u8pBaseScript = (uint8 code *)m_u8aTemp_45;
			if(u8CookTemp==50)  m_u8pBaseScript = (uint8 code *)m_u8aTemp_50;
            if(u8CookTemp==55)  m_u8pBaseScript = (uint8 code *)m_u8aTemp_55;
			if(u8CookTemp==60)  m_u8pBaseScript = (uint8 code *)m_u8aTemp_60;
            if(u8CookTemp==65)  m_u8pBaseScript = (uint8 code *)m_u8aTemp_65;
			if(u8CookTemp==70)  m_u8pBaseScript = (uint8 code *)m_u8aTemp_70;
            if(u8CookTemp==75)  m_u8pBaseScript = (uint8 code *)m_u8aTemp_75;
			if(u8CookTemp==80)  m_u8pBaseScript = (uint8 code *)m_u8aTemp_80;
            if(u8CookTemp==85)  m_u8pBaseScript = (uint8 code *)m_u8aTemp_85;
			if(u8CookTemp==90)  m_u8pBaseScript = (uint8 code *)m_u8aTemp_90;
            if(u8CookTemp==95)  m_u8pBaseScript = (uint8 code *)m_u8aTemp_95;
			if(u8CookTemp==100)
			{	
				if((u8ID==FUNC_ID_BAKING)||(u8ID==FUNC_ID_BROWNING))
				{
					m_u8pBaseScript = (uint8 code *)m_u8aTemp_Oil_100;	
				}
				else
				{
					m_u8pBaseScript = (uint8 code *)m_u8aTemp_Water_100;
				}
			}
            if(u8CookTemp==105) m_u8pBaseScript = (uint8 code *)m_u8aTemp_105;
			if(u8CookTemp==110) m_u8pBaseScript = (uint8 code *)m_u8aTemp_110;	
            if(u8CookTemp==115) m_u8pBaseScript = (uint8 code *)m_u8aTemp_115;
			if(u8CookTemp==120) m_u8pBaseScript = (uint8 code *)m_u8aTemp_120;	
            if(u8CookTemp==125) m_u8pBaseScript = (uint8 code *)m_u8aTemp_125;	
			if(u8CookTemp==130) m_u8pBaseScript = (uint8 code *)m_u8aTemp_130;	
            if(u8CookTemp==135) m_u8pBaseScript = (uint8 code *)m_u8aTemp_135;
		    if(u8CookTemp==140) m_u8pBaseScript = (uint8 code *)m_u8aTemp_140;	
            if(u8CookTemp==145) m_u8pBaseScript = (uint8 code *)m_u8aTemp_145;
			if(u8CookTemp==150) m_u8pBaseScript = (uint8 code *)m_u8aTemp_150;
            if(u8CookTemp==155) m_u8pBaseScript = (uint8 code *)m_u8aTemp_155;
		    if(u8CookTemp==160) m_u8pBaseScript = (uint8 code *)m_u8aTemp_160;
		    break;
        case 	FUNC_ID_SOUP:
            m_u8pBaseScript	=	(uint8 code	*)m_u8aSoup; 
            break;
        case	FUNC_ID_PASTA:
            m_u8pBaseScript = (uint8 code *)m_u8aPasta;     
            break;
        case	FUNC_ID_BREADRISING:
            if(u8CookTemp==30) m_u8pBaseScript = (uint8 code *)m_u8aTemp_30;
            if(u8CookTemp==40) m_u8pBaseScript = (uint8 code *)m_u8aTemp_40;
            break;
        case    FUNC_ID_CREAMCHEESE:
            m_u8pBaseScript = (uint8 code *)m_u8aCreamcheese;  
            break;
        case	FUNC_ID_YOGURT: 
            m_u8pBaseScript = (uint8 code *)m_u8aYoghurt;   
            break;
        case    FUNC_ID_JAM:
            m_u8pBaseScript = (uint8 code *)m_u8aJam;  
            break;
        case    FUNC_ID_REHEAT:
            if(u8CookTemp==80) m_u8pBaseScript = (uint8 code *)m_u8aReheat_80;
            if(u8CookTemp==100) m_u8pBaseScript = (uint8 code *)m_u8aReheat_100; 		
			break;  
		default:
			break;
	}	
	ResetCurScript();	
}

/*-----------------------------------------------------------------------------*
 *  Function Description:                                                      *
 *      烹饪处理进程                                  				           *
 *  Parameters:                                                                *
 *      None                                                                   *
 *  Return                                                                     *
 *      None                                                                   *
 *----------------------------------------------------------------------------*/
void 	ScriptProc(void)
{
	uint8	u8Tmp;

	if(g_u8ErrorType)	return;				//如果系统处于报警状态，不执行Script

	if(bCookBySctEN)							//如果Script有效，执行Script
	{
		if(m_u8pScript==NULL)
		{
			m_u8pScript	=	m_u8pBaseScript+m_u8pBaseScript[m_u8ScriptStage];
		}

		if(bSys_1000MS)	m_u16CookTime++;

		while(m_u8pScript!=NULL)
		{
			switch(m_u8pScript[0])
			{
				//=========================================
				//底部温度指令,格式:00,LoTmp,HiTmp,OnTime,OffTime,bBoilChk_EN
				case 	0x00:
						SetBotTemp(m_u8pScript);	//设置底部温度
						m_u8pScript	+=	6;
						break;

			 	//=========================================
				//温度跳转指令,格式:1/2/3/4,Temp,JmpStage
				case	0x01:
				case	0x02:
				case	0x03:
				case	0x04:
						u8Tmp	=	ByTemp_ChgStage(m_u8pScript);
						m_u8pScript	+=	3;
						ChangeScriptStage(u8Tmp);
						break;

		   		//=========================================
				//时间跳转指令,格式：5/6/7/8/9,TimeLo,TimeHi,JmpStage
				case	0x05:
				case	0x06:
				case	0x07:
				case	0x08:
				case	0x09:
						u8Tmp	=	ByTime_ChgStage(m_u8pScript);
						m_u8pScript	+=	4;
						ChangeScriptStage(u8Tmp);
						break;

				//=========================================
				//加热功率参数,格式：0x0a/0x0b,PowerLevel
				//case	0x0a:					//最大加热功率
				//case	0x0b:					//最小加热功率
				//		SetPowerLevel(m_u8pScript);
				//		m_u8pScript	+=	2;
				//		break;

				//=========================================
				//顶部和侧面加热指令,格式：0x0c/0x0d,u8JmpMode,Temp
				case    0x0c:                   //顶部加热控制
				case    0x0d:                   //侧部加热控制			
						Heat_Ctr(m_u8pScript);
						m_u8pScript	+=	3;
						break;

				//=========================================
				//特别指令，目前包括进入保温
				case	0x0e:
						u8Tmp = OtherCmds(m_u8pScript);
						if(m_u8pScript==NULL)	break;	  //保温直接跳出
						else	m_u8pScript	+=	5;
						ChangeScriptStage(u8Tmp);
						break;

				case	0xff:
						m_u8pScript	=	NULL;
						break;

			 	default:
						EnterReset();	   		//脚本出错复位
						break;
			}
		}
	}
}

/*-----------------------------------------------------------------------------*
 *  Function Description:                                                      *
 *      当前状态转换                                   				           *
 *  Parameters:                                                                *
 *      u8Stage需要跳转的状态                                                  *
 *  Return                                                                     *
 *      None                                                                   *
 *----------------------------------------------------------------------------*/
void	ChangeScriptStage(uint8	u8Stage)
{
	if(u8Stage==0xff)	return;
	m_u8ScriptStage	=	u8Stage&0x7f;
	if(u8Stage&0x80)	m_u16CookTime	=	0;
}

/*-----------------------------------------------------------------------------*
 *  Function Description:                                                      *
 *      设置底部温度范围                                   				       *
 *  Parameters:                                                                *
 *      pScript，脚本数据                                                      *
 *  Return                                                                     *
 *      None                                                                   *
 *----------------------------------------------------------------------------*/
void	SetBotTemp(uint8 code *pScript)
{
    uint8 u8BotDegree = ADCGetData(AD_CH_BOT);
	g_u8LoTemp	=	pScript[1];
	g_u8HiTemp	=	pScript[2];
	g_u8OnTime_Set	=	pScript[3];
	g_u8OffTime_Set	=	pScript[4];
	
	if(pScript[5]==0x0A)	bBoilChk_EN	=	1;	//使能沸腾检测
	else	bBoilChk_EN	=	0;					//禁止沸腾检测
	
	/*-----------------可调温度区间设计---------------------*/
	
	if((g_u8LoTemp==0xf1)&&(g_u8HiTemp==0xf1))  //吸水维持温度S1 
	{
	    g_u8LoTemp = g_u16VarParam[SOAK_TEMP_KEEP_S1];
		g_u8HiTemp = g_u16VarParam[SOAK_TEMP_KEEP_S1]+1;
	}
	if((g_u8LoTemp==0xf2)&&(g_u8HiTemp==0xf2))  //吸水维持温度S2(Brownrice_Nutritious)
    {
        g_u8LoTemp = g_u16VarParam[SOAK_TEMP_KEEP_S2];
		g_u8HiTemp = g_u16VarParam[SOAK_TEMP_KEEP_S2]+1;
    }
    
	/*-----------------可调加热功率设置--------------------*/
	if(g_u8OnTime_Set>0xf0)
	{
		if(g_u8OnTime_Set==0xf1)		//饭&&粥&&稀饭&&汤
		{
			g_u8OnTime_Set	=	m_u8AddOnParam;  	
		}	
		
		if(g_u8OnTime_Set==0xf2)		//粥&&稀饭&&汤
		{
			g_u8OnTime_Set	=	m_u8AddOnParam/2;	
			if(g_u8OnTime_Set<8) g_u8OnTime_Set = 8;   //最小功率限制
		}	
        
        if(g_u8OnTime_Set==0xf3)		//Fry
		{
			if(u8CookTemp==160)
			{
				if(u8BotDegree<151)
				{
					g_u8OnTime_Set = 163-u8BotDegree;
					if(g_u8OnTime_Set>20) g_u8OnTime_Set = 20; 
				}
				else
				{
					g_u8OnTime_Set = 0;
				}
			}         

            if(u8CookTemp==155)
			{
				if(u8BotDegree<146)
				{
					g_u8OnTime_Set = 158-u8BotDegree;
					if(g_u8OnTime_Set>20) g_u8OnTime_Set = 20; 
				}
				else
				{
					g_u8OnTime_Set = 0;
				}
			} 
			
			if(u8CookTemp==150)
			{
				if(u8BotDegree<141)
				{
					g_u8OnTime_Set = 153-u8BotDegree;
					if(g_u8OnTime_Set>20) g_u8OnTime_Set = 20; 
				}
				else
				{
					g_u8OnTime_Set = 0;
				}
			}

            if(u8CookTemp==145)
			{
				if(u8BotDegree<136)
				{
					g_u8OnTime_Set = 148-u8BotDegree;
					if(g_u8OnTime_Set>20) g_u8OnTime_Set = 20; 
				}
				else
				{
					g_u8OnTime_Set = 0;
				}
			}
			
			if(u8CookTemp==140)
			{
				if(u8BotDegree<131)
				{
					g_u8OnTime_Set = 143-u8BotDegree;
					if(g_u8OnTime_Set>20) g_u8OnTime_Set = 20; 
				}
				else
				{
					g_u8OnTime_Set = 0;
				}
			}

            if(u8CookTemp==135)
			{
				if(u8BotDegree<127)
				{
					g_u8OnTime_Set = 139-u8BotDegree;
					if(g_u8OnTime_Set>20) g_u8OnTime_Set = 20; 
				}
				else
				{
					g_u8OnTime_Set = 0;
				}
			}
			
			if(u8CookTemp==130)
			{
				if(u8BotDegree<122)
				{
					g_u8OnTime_Set = 134-u8BotDegree;
					if(g_u8OnTime_Set>20) g_u8OnTime_Set = 20; 
				}
				else
				{
					g_u8OnTime_Set = 0;
				}
			}

            if(u8CookTemp==125)
			{
				if(u8BotDegree<117)
				{
					g_u8OnTime_Set = 129-u8BotDegree;
					if(g_u8OnTime_Set>20) g_u8OnTime_Set = 20; 
				}
				else
				{
					g_u8OnTime_Set = 0;
				}
			}
			
			if(u8CookTemp==120)
			{
				if(u8BotDegree<112)
				{
					g_u8OnTime_Set = 124-u8BotDegree;
					if(g_u8OnTime_Set>20) g_u8OnTime_Set = 20; 
				}
				else
				{
					g_u8OnTime_Set = 0;
				}
			}
   
            if(u8CookTemp==115)
			{
				if(u8BotDegree<107)
				{
					g_u8OnTime_Set = 119-u8BotDegree;
					if(g_u8OnTime_Set>20) g_u8OnTime_Set = 20; 
				}
				else
				{
					g_u8OnTime_Set = 0;
				}
			}
			
			if(u8CookTemp==110)
			{
				if(u8BotDegree<102)
				{
					g_u8OnTime_Set = 114-u8BotDegree;
					if(g_u8OnTime_Set>20) g_u8OnTime_Set = 20; 
				}
				else
				{
					g_u8OnTime_Set = 0;
				}
			}

            if(u8CookTemp==105)
			{
				if(u8BotDegree<100)
				{
					g_u8OnTime_Set = 112-u8BotDegree;
					if(g_u8OnTime_Set>20) g_u8OnTime_Set = 20; 
				}
				else
				{
					g_u8OnTime_Set = 0;
				}
			}
            
			if(u8CookTemp==100)
			{
				if(u8BotDegree<98)
				{
					g_u8OnTime_Set = 110-u8BotDegree;
					if(g_u8OnTime_Set>20) g_u8OnTime_Set = 20; 
				}
				else
				{
					g_u8OnTime_Set = 0;
				}
			}		
		}
	}

	if(g_u8OffTime_Set>0xf0)
	{
		if(g_u8OffTime_Set==0xf1)		//饭&&粥&&稀饭&&汤
		{
			g_u8OffTime_Set	=	m_u8AddOffParam;
			if(g_u8OffTime_Set==0)
			{
				g_u8OnTime_Set = 0xf0;	//连续加热
			}
		}
		
		if(g_u8OffTime_Set==0xf2)		//粥&&稀饭&&汤(80->90)
		{
			g_u8OffTime_Set	= 35;		
		}
		
//		if(g_u8OffTime_Set==0xf3)		//粥&&稀饭&&汤(90->100)
//		{
//			//-----------------粥--------------------
//			if(m_u8CookMode==4)
//			{	
//				if(m_u8AddOnParam>=18)
//				{
//				    g_u8OffTime_Set	= 55+m_u8AddOffParam;
//				}
//				else
//				{
//				    g_u8OffTime_Set = 48+m_u8AddOffParam;
//				}
//				
//				if(m_u8AddOnParam>=22)
//				{
//					g_u8OffTime_Set +=5;
//				}
//			}
//			
//			//-----------------稀饭------------------
//			if(m_u8CookMode==5)
//			{
//				g_u8OffTime_Set	= 60+m_u8AddOffParam;
//			}
//			
//			//-----------------汤--------------------
//			if(m_u8CookMode==7)
//			{
//				g_u8OffTime_Set = 38+m_u8AddOffParam;
//			}
//		}
        
        if(g_u8OffTime_Set==0xf4)		//Fry
		{
			g_u8OffTime_Set = 30 - g_u8OnTime_Set;
		}
	}
}

/*-----------------------------------------------------------------------------*
 *  Function Description:                                                      *
 *      温度跳转处理                                   				           *
 *  Parameters:                                                                *
 *      pScript，脚本数据                                                      *
 *  Return                                                                     *
 *      跳转的状态,0xff不跳转,其他值跳转                                       *
 *----------------------------------------------------------------------------*/
uint8	ByTemp_ChgStage(uint8 code *pScript)
{
	uint8   i	=	pScript[1];					//跳转温度值
	uint8	u8ChReq	=	0;		                //跳转标志位
	uint8	u8BotDegree	=	ADCGetData(AD_CH_BOT);
	uint8	u8TopDegree	=	ADCGetData(AD_CH_TOP);


	switch(pScript[0])
	{
		case	1:	
				if(u8BotDegree > i)
				{
					u8ChReq	=	1;
			  	}
				break;
	 	case	2:
				if(u8BotDegree < i)
				{
					u8ChReq	=	1;
				}
				break;
  		case	3:
				if(u8TopDegree > i)
				{
					u8ChReq	=	1;
				}
				if(bBoilChk_EN&&bBoilReach)	//沸腾判断&&已沸腾
				{
					u8ChReq	=	1;
				}
				break;
   		case	4:
				if(u8TopDegree < i)
				{
					u8ChReq	=	1;
				}
				break;
		default:
				break;
	}

	if(u8ChReq)
	{
		return	pScript[2];
	}
	return	0xff;
}

/*-----------------------------------------------------------------------------*
 *  Function Description:                                                      *
 *      时间跳转处理                                   				           *
 *  Parameters:                                                                *
 *      pScript，脚本数据                                                      *
 *  Return                                                                     *
 *      跳转的状态,0xff不跳转,其他值跳转                                       *
 *----------------------------------------------------------------------------*/
uint8	ByTime_ChgStage(uint8 code	*pScript)
{
	uint16	u16Time	=	pScript[1]+pScript[2]*256;		//指定的时间条件(分钟)

	if(pScript[0]==9)									//烹饪时间清零
	{
		m_u16CookTime	=	0;
		return	0xff;
 	}

	//========================================================
	//5和6为分钟跳转,5为大于指定分钟跳转，6为小于指定分钟跳转
	//7和8为秒的跳转,7为大于指定秒跳转，8为小于指定秒跳转

	if(pScript[0]==5||pScript[0]==6)
	{
		if(u16Time > 0xf0)
		{					
			if(u16Time==0xf1)							//吸水升温时间S1
			{					
                u16Time = g_u16VarParam[SOAK_TIME_RISE_S1];
			}
            if(u16Time==0xf2)                           //吸水维持时间S1
            {
                u16Time = g_u16VarParam[SOAK_TIME_KEEP_S1];
            }
            if(u16Time==0xf3)                           //吸水升温时间S2(Brownrice_Nutritious)
            {
                u16Time = g_u16VarParam[SOAK_TIME_RISE_S2];
            }
            if(u16Time==0xf4)                           //吸水维持时间S2(Brownrice_Nutritious)
            {
                u16Time = g_u16VarParam[SOAK_TIME_KEEP_S2];
            }
            if(u16Time==0xf5)                           //糊化时间
            {
                u16Time = g_u16VarParam[MASH_TIME];
            }
		}
		else
		{
		    u16Time	*=	60;
		}
	}

	if(pScript[0]==5||pScript[0]==7)
	{
		if(m_u16CookTime > u16Time)
		{
			return	pScript[3];
		}
	}
	else
	{
		if(m_u16CookTime < u16Time)
		{
			return	pScript[3];
		}
	}
	return	0xff;
}

/*-----------------------------------------------------------------------------*
 *  Function Description:                                                      *
 *      设置功率等级                                   				           *
 *  Parameters:                                                                *
 *      pScript，脚本数据                                                      *
 *  Return                                                                     *
 *      None                                                                   *
 *----------------------------------------------------------------------------*/
//void	SetPowerLevel(uint8	code *pScript)
//{
//	switch(pScript[0])
//	{
//		case	0x0a:								//设定最大加热功率
//				_nop_();
//				break;
//	 	case	0x0b:								//设定最小加热功率 
//				_nop_();
//				break;
//		default:
//				break;
//	}
//}

/*-----------------------------------------------------------------------------*
 *  Function Description:                                                      *
 *      顶侧加热处理                                   				           *
 *  Parameters:                                                                *
 *      pScript，脚本数据                                                      *
 *  Return                                                                     *
 *      None                                                                   *
 *----------------------------------------------------------------------------*/
void	Heat_Ctr(uint8 code	*pScript)
{
	uint8	u8ChReq	=	0;							//开断标志位
	uint8	u8BotDegree	=	ADCGetData(AD_CH_BOT);
	uint8	u8TopDegree	=	ADCGetData(AD_CH_TOP);

	if(pScript[2]!=0)								//Temp
	{
		switch(pScript[1])
		{
			case	1:
					if(u8TopDegree < pScript[2])
					{
						u8ChReq	=	1;				//开
					}
					break;
			case	2:
					if(u8TopDegree > pScript[2])
					{
						u8ChReq	=	2;        		//断
				 	}
					break;
			case	5:
					if(u8BotDegree < pScript[2])
					{
						u8ChReq	=	1;				//开
				  	}
					break;
	   		case	6:
					if(u8BotDegree > pScript[2])
					{
						u8ChReq	=	2;        		//断
				 	}
					break;
			default:
					u8ChReq	=	0;
					break;
	   	}
	}
	else
	{
		//直接输入或输出
		if(pScript[1]==1)
		{
			u8ChReq	=	1;							//开
		}
		else
		{
			u8ChReq	=	2;        					//断
		}
	}

	if(u8ChReq==1)
	{
		if(pScript[0]==0x0c)
		{
			bHeatTopReq	=	1;						//打开顶部加热
	  	}
		else	//pScript[0]==0x0d
		{
			bHeatArdReq	=	1;						//打开侧部加热
	 	}
	}
	
	if(u8ChReq==2)
	{
		if(pScript[0]==0x0c)
		{
			bHeatTopReq	=	0;						//关闭顶部加热
	 	}
		else	//pScript[0]==0x0d
		{
			bHeatArdReq	=	0;						//关闭侧部加热
	 	}
	}
}


/*-----------------------------------------------------------------------------*
 *  Function Description:                                                      *
 *      特殊跳转处理                                   				           *
 *  Parameters:                                                                *
 *      pScript，脚本数据                                                      *
 *  Return                                                                     *
 *      None                                                                   *
 *----------------------------------------------------------------------------*/
uint8	OtherCmds(uint8	code *pScript)
{
    uint8	u8TopDegree	=	ADCGetData(AD_CH_TOP);
    uint8	u8ChReq	= 0;    //跳转标志位
	uint8   u8ExtStage = 0xff;
	
	switch(pScript[1])
	{
		case	1:									//结束当前状态，进入保温模式
				EnterWarm();
                bWarm_Start = 1;
                bSys1S_CookTime = 1;                //立即刷新显示
                PlaySound(MusicCookEnd);
				break;
	  	case	2:									//烹饪时间倒计时
	  			if((tmCookTime[0]==59)&&(tmCookTime[1]==0)&&(tmCookTime[2]==0))
				{
					tmCookTime[0]	=	59;
					tmCookTime[1]	=	g_u16VarParam[COUNTDOWN_TIME]%60;
					tmCookTime[2]	=	g_u16VarParam[COUNTDOWN_TIME]/60;
                    if((m_u8CookMode!=FUNC_ID_CHICKPEAS)&&(m_u8CookMode!=FUNC_ID_BEANS))
                    {
					    PlaySound(MusicCountDown);
                    }
				}
				break;
		case	3:		
		        //--------------------------------------------------
				//加热时间计算
				if(pScript[2]==0)	
				{
					//---------------煮粥维持沸腾火力---------------
					if(pScript[3]==0)
					{
						if(g_u16RelayTime)
						{
							m_u8AddOnParam	=	g_u16RelayTime/60;
						}
						else
						{
							m_u8AddOnParam	=	16;		//热锅维持功率
						}
						m_u8AddOffParam		=	0;	
					}
					
//					if(bSys_1000MS)	m_u16MashTime++;	
					
					//----------------煮饭糊化小火力------------------
					if(pScript[3]==1)
					{
						m_u8AddOnParam	=	g_u16RelayTime/120;
						if(m_u8AddOnParam<8)	m_u8AddOnParam = 8;
						if(m_u8AddOnParam>12)	m_u8AddOnParam = 12;
//						if((bBoilReach)&&(m_u8BoilDegree<=90))	//高原判断
//						{
//							m_u8AddOnParam = m_u8AddOnParam - 2;
//						}
						m_u8AddOffParam = 30 - m_u8AddOnParam;	
					}
					
					//----------------煮饭糊化大火力------------------
					if(pScript[3]==2)
					{
						m_u8AddOnParam	=	g_u16RelayTime/60;
						if(m_u8AddOnParam<12)	m_u8AddOnParam = 12;
						if(m_u8AddOnParam>20)	m_u8AddOnParam = 20;
						m_u8AddOffParam = 30 - m_u8AddOnParam;	
					}
				}
				
//                //--------------------------------------------------
//				//功率递减(粥&&稀饭&&汤)
//				if(pScript[2]==1)					
//				{			
//					if(bSys_1000MS)	m_u16IntCookTime++;
//					
//					//-----------------粥-----------------------
//					if(m_u8CookMode==4)
//					{
//				        if(m_u16IntCookTime>=240)		//4min
//						{
//						    m_u16IntCookTime = 0;
//						  //m_u8AddOnParam	-= 1;
//							m_u8AddOffParam	+= 2;
//						}
//						if(m_u8AddOnParam<16)	m_u8AddOnParam	= 16;
//						if(m_u8AddOnParam>28)	m_u8AddOnParam	= 28;
//						if(m_u8AddOffParam>16)	m_u8AddOffParam	= 16;
//				    }
//					
//					//-----------------稀饭---------------------
//					if(m_u8CookMode==5)
//					{
//				        if(m_u16IntCookTime>=300)		//5min
//						{
//						    m_u16IntCookTime = 0;
//						    m_u8AddOnParam	-= 1;
//							m_u8AddOffParam	+= 2;
//						}
//						if(m_u8AddOnParam<12)	m_u8AddOnParam	= 12;
//						if(m_u8AddOnParam>20)	m_u8AddOnParam	= 20;
//						if(m_u8AddOffParam>20)	m_u8AddOffParam	= 20;
//				    }
//						
//					//-----------------汤-----------------------
//					if(m_u8CookMode==7)
//					{
//					    if(m_u16IntCookTime>=480)		//8min
//						{
//							m_u16IntCookTime = 0;
//							m_u8AddOnParam	-= 1;
//							m_u8AddOffParam	+= 2;
//						}
//						if(m_u8AddOnParam<20)	m_u8AddOnParam	= 20;
//						if(m_u8AddOnParam>40)	m_u8AddOnParam	= 40;
//						if(m_u8AddOffParam>12)	m_u8AddOffParam	= 12;
//					}
//				}
					
				//--------------------------------------------------
				//设定火力控制初始值
				if(pScript[2]==2) 					
				{
					m_u8EstimateTemp	=	pScript[3];				//预估温度初始值
					m_u8AddOnParam		=	g_u16RelayTime/60+10;	//功率初始值
					if(m_u8AddOnParam>24)	m_u8AddOnParam	=	24;
					if(m_u8AddOnParam<12)	m_u8AddOnParam	=	12;
					m_u8AddOffParam	=	30-m_u8AddOnParam;		
				}

                //--------------------------------------------------
				//根据温差调整火力
				if(pScript[2]==3)
				{
					m_u8TargetTemp		=	pScript[3];	
					
					//-----------------煮饭-------------------------
			 		if(pScript[4]==1)						
					{
						if(m_u8TargetTemp==85)				//目标温度85度
						{
							if(u8TopDegree>72)	
							{
								m_u8OffsetTemp	=	2;		//上盖温度大于72度,偏移温度2
							}
							else
							{
								m_u8OffsetTemp	=	4;		//上盖温度小于72度,偏移温度4
							}
							m_u8OnTimeDec	=	3;			//加热时间减少量3S
							m_u8OnTimeInc	=	2;			//加热时间增加量2S
							m_u8MinOnTime_Set	=	10;		//最小加热时间10S
							m_u8MaxOnTime_set	=	30;		//最大加热时间30S
							m_u8PwrCycle	=	30;			//调功周期30S							
						}
					
						if(m_u8TargetTemp==98)				//目标温度98度
						{
							m_u8OffsetTemp	=	1;			//偏移温度1
							m_u8OnTimeDec	=	1;          //加热时间减少量1S
							m_u8OnTimeInc	=	1;          //加热时间增加量1S
							m_u8MinOnTime_Set	=	8;      //最小加热时间8S
							m_u8MaxOnTime_set	=	g_u16RelayTime/60+3;     //最大加热时间=继电器打开时间+3S
							if(m_u8MaxOnTime_set>20)	
							{
								m_u8MaxOnTime_set = 20;
							}
							m_u8PwrCycle	=	30;			//调功周期30S
						}
					}
					
					//-------------------粥&&稀饭&&煲汤-------------------------
					if(pScript[4]==2)						
					{
						if(m_u8TargetTemp==90)				//目标温度90度
						{
							if(u8TopDegree>78)	
							{
								m_u8OffsetTemp	=	2;		//上盖温度大于78度,偏移温度2
								m_u8MaxOnTime_set	=	20;	//最大加热时间20S
							}
							else
							{
								m_u8OffsetTemp	=	3;		//上盖温度小于78度,偏移温度3
								m_u8MaxOnTime_set	=	30;	//最大加热时间30S
							}
							m_u8OnTimeDec	=	3;			//加热时间减少量3S
							m_u8OnTimeInc	=	2;			//加热时间增加量2S
							m_u8MinOnTime_Set	=	12;		//最小加热时间12S
							m_u8PwrCycle	=	30;			//调功周期30S
						}
					}
					GetPowerByDT();							//根据温差调功
				}
				break;
            case    4:			//外部控制跳转
				if(bTimeCountDown)
				{
					u8ChReq = 1;
					u8ExtStage = 2;	//pasta 按下开始键
				}
				break;
		default:
				break;
	}
	
	if(u8ChReq)
	{
		return	  u8ExtStage;
	}
	return	0xff;
}

/*-----------------------------------------------------------------------------*
 *  Function Description:                                                      *
 *      根据温差调整功率                                				       *
 *  Parameters:                                                                *
 *      None                                                                   *
 *  Return                                                                     *
 *      None                                                                   *
 *----------------------------------------------------------------------------*/
void	GetPowerByDT(void)
{
	uint8	u8TopDegree	=	ADCGetData(AD_CH_TOP);
	
	if(bSys_1000MS)	m_u16IntCookTime++;
	if(m_u16IntCookTime>=30)		//调功周期30S
	{
		m_u16IntCookTime	=	0;
		m_u8EstimateTemp	+=	m_u8OffsetTemp;

        if(m_u8EstimateTemp>m_u8TargetTemp)
		{
			m_u8EstimateTemp =	m_u8TargetTemp;
		}
		
		//顶部温度大于预期值,加热时间缩短
		if(u8TopDegree>m_u8EstimateTemp)
		{
			m_u8AddOnParam	-=	m_u8OnTimeDec;		
		}
		
		//顶部温度小于预期值,加热时间增加
		if(u8TopDegree<m_u8EstimateTemp)
		{
			m_u8AddOnParam	+=	m_u8OnTimeInc;
		}
		
		//判断加热时间是否正确
		if(m_u8AddOnParam>m_u8MaxOnTime_set)
		{
			m_u8AddOnParam	=	m_u8MaxOnTime_set;
		}
		
		if(m_u8AddOnParam<m_u8MinOnTime_Set)
		{
			m_u8AddOnParam	=	m_u8MinOnTime_Set;
		}
		
		if(m_u8PwrCycle>m_u8AddOnParam)
		{
			m_u8AddOffParam	=	m_u8PwrCycle-m_u8AddOnParam;	
		}
		else
		{
			m_u8AddOffParam	=	0;
		}
		
		//更新预期值	
		m_u8EstimateTemp	=	u8TopDegree;	
	}
}
 
/*-----------------------------------------------------------------------------*
 *  Function Description:                                                      *
 *      沸腾检测                                                               *
 *  Parameters:                                                                *
 *      None                                                                   *
 *  Return                                                                     *
 *      None                                                                   *
 *----------------------------------------------------------------------------*/
//void	BoilCheckProc(void)
//{
//	uint8	u8TopDegree	=	ADCGetData(AD_CH_TOP);
//	uint8	i;

//	if(bBoilChk_EN)
//	{
//		if(bSys_1000MS)	m_u8BoilChkTime++;

//		if(m_u8BoilChkTime>=60/BOIL_DATA_PER_MIN)	 								
//		{
//			m_u8BoilChkTime	=	0;
//	
//			for(i=0;i<BOIL_TEMP_SIZE-1;i++)			//填充缓冲区		
//			{
//				u8BoilTempBuf[i]	=	u8BoilTempBuf[i+1];		
//			}
//			u8BoilTempBuf[BOIL_TEMP_SIZE-1]	=	u8TopDegree;

//			for(i=0;i<BOIL_TEMP_SIZE;i++)  			//备份缓冲区
//			{
//				u8BoilTempBufBAK[i]	=	u8BoilTempBuf[i];
//			}				

//			u8BoilChkCnt++;							

//			if(u8BoilChkCnt== BOIL_TEMP_SIZE)	   	//判断是否填充完成
//			{
//				u8BoilChkCnt = u8BoilChkCnt - 1;

//				Sort8(u8BoilTempBufBAK,BOIL_TEMP_SIZE);	//排序

//				if((u8BoilTempBufBAK[BOIL_TEMP_SIZE-1]-u8BoilTempBufBAK[0])<BOIL_OFFSET_VAL)
//				{			
//					bBoilReach	=	1;
//					m_u8BoilDegree	=	u8TopDegree;	
//					//PlaySound(MusicCookEnd);			//已沸腾提示	
//				}				
//			}
//		}
//	}	

//	if(bBoilReach)		
//	{
//		if(u8TopDegree>m_u8BoilDegree)
//		{
//			m_u8BoilDegree	=	u8TopDegree;      //更新沸点
//		}
//	}
//}
